{"changelog":[{"commit":"939c6a7","dated":"July 3rd 2019","header":"/h/v20190703.png","notes":"\u003cp\u003eWe've made some adjustments to search.  For those of you who just can't get\nenough of the deep lore of M:tG expansion sets, we have a new search predicate,\n\u003ckbd\u003espotlight\u003c/kbd\u003e that finds \u003cem\u003eStory Spotlight\u003c/em\u003e cards.\u003c/p\u003e\n\n\u003cp\u003eThe biggest new feature for VQL, however, has got to be \u003cem\u003euniqueness\u003c/em\u003e\nfiltering.  There have been lots of cards printed over the years, and a sizable\nchunk of those are reprints.  We've always had the \u003ckbd\u003ereprint\u003c/kbd\u003e predicate,\nbut that doesn't work when you're trying to limit to recent sets.\u003c/p\u003e\n\n\u003cp\u003eNow, you can drop all those pesky duplicates by adding \u003ckbd\u003eand unique\u003c/kbd\u003e\nto the end of your search query.  Any additional prints of any given card will\nbe removed from the resultset, cleaning things up.  This is perfect for deck\nbrewing, where you care more about the oracle text than the print edition or\npricing.\u003c/p\u003e\n\n\u003cp\u003eIf you love the art of Magic as much as we do, you'll also love the new\n\u003cem\u003eart uniqueness\u003c/em\u003e predicate too!  With \u003ckbd\u003eunique:art\u003c/kbd\u003e, you'll get\nrid of duplicate card art in your resultset.\u003c/p\u003e\n\n\u003cp\u003eThis release also marks the introduction of \u003cem\u003epreview features\u003c/em\u003e;\nstuff we want to get into the hands of users, but that aren't ready for prime\ntime just yet.  The first of those is Deck Import.  You can export decks from\nyour favorite deck builder sites, and import them into the Vault.  Afterwards,\nyou can use the new \u003ckbd\u003ein:deck-name\u003c/kbd\u003e predicate to filter based on\ninclusion in a given deck.  Now you can find all those Ninja's that \u003cem\u003earen't\u003c/em\u003e\nin your Yuriko deck.\u003c/p\u003e\n\n\u003cp\u003eContact James if you want early access to preview features!\u003c/p\u003e\n","release":"v20190703","title":"Story Spotlights, Uniqueness, and Deck Imports"},{"commit":"c3326b6","dated":"May 3rd 2019","header":"/h/v20190503.png","notes":"\u003cp\u003eOkay, we've been working on this one for a long time, so bear with us...\u003c/p\u003e\n\n\u003cp\u003eVault of Cardboard's collection management facilities just got a major boost.\nNo longer are you required to manage a single listing of all the cards in your\nentire collection.  Instead, you can start with an initial import, and then use\n\u003cem\u003eBuy\u003c/em\u003e and \u003cem\u003eSell\u003c/em\u003e events to add cards to, and remove cards from your\ncollection.\u003c/p\u003e\n\n\u003cp\u003eI started doing this when I first got back into Magic, using spreadsheets and\nsome cobbled-together scripts to consolidate all the data.  I found it useful to\nbe able to go through and figure out when I got what cards, where they came from\n(did I buy packs?  singles?  did someone gift them to me?), etc.\u003c/p\u003e\n\n\u003cp\u003eNow you can do that too!  Keep in mind, this is still in beta, and probably\nhas lots of bugs and corner cases that we haven't had a chance to suss out.\u003c/p\u003e\n\n\u003cp\u003eOh, and if you need an account (we're still in closed registration), let us know!\u003c/p\u003e\n","release":"v20190503","title":"Buy / Sell / Trade Collection Management (BETA)"},{"dated":"April 27th, 2019","header":"/h/v20190427.png","notes":"\u003cp\u003eIt's officially War of the Spark Prerelease Weekend, so we've added\n\u003ca href=\"#!/q/set:WAR\"\u003ethe \u003ccode\u003eWAR\u003c/code\u003e set\u003c/a\u003e to Vault's database.\nHave fun spelunking through all that new \u003cem\u003eamass\u003c/em\u003e / \u003cem\u003eproliferate\u003c/em\u003e\ngoodness, and drooling over those new walkers!\u003c/p\u003e\n","release":"v20190427","title":"War of the Spark Prerelease Weekend"},{"commit":"0e3227e..f9da098","dated":"March 5th, 2019","header":"/h/v20190305.png","notes":"\u003cp\u003eWe now have card data on Tokens!  You can find tokens the same way\nyou find any other card, since the word \"Token\" shows up in their type\nline: \u003ccode\u003etype:token\u003c/code\u003e works like a champ.  The Vault even supports\nthose pesky double-faced tokens from the Ravnica Guild Kits (GK1 / GK2).\u003c/p\u003e\n\n\u003cp\u003eLike flip cards?  Then you'll love the new \u003cem\u003eflippy\u003c/em\u003e UI widget we've\nadded to the Kamigawa flip cards, and the Innistrad transform cards.  Click\nthe little rotate-y icon in the bottom right corner of a multi-faced card\nand the other card face will be shown.  The modal card view even blows up\nwhatever face is shown in the grid!\u003c/p\u003e\n\n\u003cp\u003eFinally, the color breakdown of the entire search resultset is now encoded\nin a 5-color bar at the top of the page.  Ever wonder who has the most draw-based\ndamage?  Just search for \u003ca href=\"#!/q/+draw%20and+damage\"\u003e+draw\nand +damage\u003c/a\u003e and you'll get immediate confirmation that it's mostly a\nblue / red thing.\u003c/p\u003e\n","release":"v20190305","title":"Tokens, Flip Cards, and Color Splash!"},{"commit":"b0c4280..2b69dec","dated":"March 3rd, 2019","header":"/h/v20190303.png","notes":"\u003cp\u003eThe \u003ca href=\"#!/docs\"\u003eVault of Cardboard Query Language\u003c/a\u003e now\nhandles adjacent \u003cem\u003ebare word\u003c/em\u003e identifiers as parts of a card name.\nThat means you can now search \u003ccode\u003elady of scrolls\u003c/code\u003e rather than\nthe (less specific) \u003ccode\u003elady AND of AND scrolls\u003c/code\u003e.  We've caught\nourselves just typing card names into the search bar one too many times\nto not just fix this.\u003c/p\u003e\n\n\u003cp\u003eLoading screens look prettier, but here's hoping you don't have to\nspend enough time looking at them to notice...\u003c/p\u003e\n","release":"v20190303","title":"Even More Search Niceties"},{"commit":"fc4b0c9..6ebeb38","dated":"March 2nd, 2019","header":"/h/v20190302.png","notes":"\u003cp\u003eThis update has a whole bunch of visual tweaks and improvements,\nas well as a long-overdue addition to the querying capability.\u003c/p\u003e\n\n\u003cp\u003eThe Vault now supports a \u003ccode\u003elegal:...\u003c/code\u003e predicate, allowing\nyou to refine your card search based on ban lists and pre-constructed\nformat rules.  It's never been easier to stay within the confines of\nModern, Vintage, Legacy, Standard, Brawl, and EDH/Commander.\u003c/p\u003e\n\n\u003cp\u003eAlso, the \u003cem\u003eunusual\u003c/em\u003e card formats are now queryable!  The Vault\nnow lets you search for cards based on their card layout, so you can finally\nfind all those splits, transform cards, melds, and flippies.\u003c/p\u003e\n\n\u003cp\u003eFor prerelease and spoilers, Scryfall uses low-resolution digitals,\nso our RNA card faces looked bad.  Those have been refreshed,\nand the backend systems updated to avoid that in the future, as new\nsets are released.\u003c/p\u003e\n\n\u003cp\u003eWe now also have a \"blank\" card face which browsers will load before\nattempting to fetch the actual card faces.  This makes the whole user\nexperience way nicer on slower links (i.e. conference / airport wifi).\u003c/p\u003e\n","release":"v20190302","title":"My Pretties..."},{"commit":"358f16d..d7d57a7","dated":"January 25th, 2019","header":"/h/v20190125.png","notes":"\u003cp\u003e\u003ca href=\"#!/q/set:RNA\"\u003eRavnica Allegiance is out!\u003c/a\u003e\nWe've got all the cards and all the images for the newest set, where we get to\nplay as the other five Ravnican guilds: Orzhov, Rakdos, Simic, Gruul, and Azorius.\u003c/p\u003e\n\n\u003cp\u003eThe Vault now supports mobile browsing, both on small screens (like my ancient\niPhone 5s) and tablet-sized displays (like my wife's iPad Pro).  Try it out and see\nwhat you think!  Now you can check the prices, oracle text, errata, and other card\ndetails, wherever you are.  We use it to settle disputes mid-game!\u003c/p\u003e\n\n\u003cp\u003eWe've done a bunch of other various updates, tweaks and fixes as well:\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003e\u003cstrong\u003eCollection imports are now normalized\u003c/strong\u003e to a single entry\n  per card+set, which can be helpful when you've got some last-minute additions\n  to the collection and don't want to bother with deduplication yourself.\u003c/li\u003e\n\n  \u003cli\u003e\u003cstrong\u003eMore Modal Card Detail.\u003c/strong\u003e  When you click on a card to get\n  more information, you now get the title, card type, and oracle text, along\n  the right-hand side of the modal.  Useful for copying / pasting into your favorite\n  chat software, or M:tG forum.  We also integrated mana and tap symbols.\u003c/li\u003e\n\n  \u003cli\u003e\u003cstrong\u003ePricing is formatted more sanely now;\u003c/strong\u003e \u003cem\u003e$120.0\u003c/em\u003e is\n  just plain embarassing.  For ludicrously expensive cards (looking at you, Reserve\n  List), we now gently remind you that cardboard is a poor investment vehicle.\u003c/li\u003e\n\n  \u003cli\u003e\u003cstrong\u003eAll tables are now click-sortable.\u003c/strong\u003e  Too many have suffered\n  with the inability to sort random tables by header columns.  No more!\u003c/li\u003e\n\u003c/ul\u003e\n","release":"v20190125","title":"Mobile Support, Ravnica Allegiance, and More"},{"commit":"5c202b0..7afcf1f","dated":"January 9th, 2019","header":"/h/v20190109.png","notes":"\u003cp\u003eWe have some new predicates in the query language that let you do some\npretty spicy stuff.  Use \u003ccode\u003eartist:...\u003c/code\u003e to find the prints by the\nartists you love.  The new power / toughness predicates (\u003ccode\u003ep/t/pt/cpt/ptr\u003c/code\u003e)\nwill finally let us brew that killer \u003ca href=\"#!/q/Wild Pair\"\u003eWild Pair\u003c/a\u003e\ndeck for some sweet library-to-battlefield shenanigans.\u003c/p\u003e\n\n\u003cp\u003eOh!  The \u003ca href=\"#!/sets\"\u003eSet Listing Page\u003c/a\u003e got some love too; we now\ntrack release dates (in a sortable table) so you can look through the sets\n(reverse) chronologically, if you're into that sort of thing.  We also lined up\nthe set icons, so they look prettier.  Visuals matter!\u003c/p\u003e\n","release":"v20190109","title":"New Query Language Predicates / Set Listing Updates"},{"commit":"45111b6..eda7a07","dated":"January 4th, 2019","header":"/h/v20190104.png","notes":"\u003cp\u003eWe were missing some images from random sets,  The ingestion process\nnow properly (and intelligently!) backfills missing images from Scryfall.\nWe have always hosted our own copies of the card images (front and back),\nto ease load on Scryfalls bottom-line, now we're just better at it.\u003c/p\u003e\n","release":"v20190104","title":"Missing Card Faces"},{"commit":"f68738b..71142ad","dated":"January 1st, 2019","header":"/h/v20190101.png","notes":"\u003cp\u003eVault of Cardboard gets a redesign!  The old full-art land login box is gone,\nas is the annoying old front page.  We here at the Vault pride ourselves on the\nvisual, aesthetic nature of the site, so this is kind of a big deal for us.\u003c/p\u003e\n\n\u003cp\u003eWe also finally sat down and wrote out how to use the \u003ca href=\"#!/docs\"\u003eVault\nof Cardboard Query Language\u003c/a\u003e \u0026mdash; it is definitely worth a read and may even\nteach you a few tricks you didn't already know!\u003c/p\u003e\n\n\u003cp\u003eThe \u003ca href=\"#!/sets\"\u003eSet Listing Page\u003c/a\u003e is new, and it shows you what sets\nthe Vault knows about.  Did we miss a set?  Let us know!\u003c/p\u003e\n","release":"v20190101","title":"Docs, Fixes, and a UI Overhaul \u0026mdash; Ooh! Shiny!!"},{"commit":"ec64054","dated":"December 27th, 2018","header":"/h/v20181227.png","notes":"\u003cp\u003e\u003cabbr title=\"Vault of Cardboard\"\u003eVCB\u003c/abbr\u003e now supports additional import\nformats, including:\u003c/p\u003e\n\n\u003cul\u003e\n  \u003cli\u003eTCGPlayer.com's \u003cabbr title=\"comma-separated values\"\u003eCSV\u003c/abbr\u003e format\u003c/li\u003e\n  \u003cli\u003e\u003ca href=\"https://archidekt.com\"\u003eArchidekt's\u003c/a\u003e deck export format\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eThe super neat thing about the TCGPlayer support is that the importer\nwill properly detect the fields it needs, in whatever order they appear in the\nCSV output, provided you include the header row.  This makes it possible to\nsupport other comma-separated formats natively!\u003c/p\u003e\n","release":"v20181227","title":"Formats, Formats, Formats"},{"commit":"0..ec64054","dated":"December, 2018","header":"/h/launch.png","notes":"\u003cblockquote class=\"ed\"\u003eI got back into Magic: the Gathering in the week\nleading up to Thanksgiving, 2018.  By early December, I had realized that\nI wanted a better search engine and collection management system.  I started\nworking on Vault of Cardboard December 13th, and I think it was deployed\nto \"production\" sometime just after Christmas.\n\u003ccite\u003ejhunt\u003c/cite\u003e\u003c/blockquote\u003e\n\n\u003cp\u003eThis is it!  The historic (as in legendary!) initial public launch\nof Vault of Cardboard.  You've got deck ideas, and we've got a search\nengine for you, rivaling that of anything we've seen out there, and\nfueled by the inimitable Scryfall data.\u003c/p\u003e\n\n\u003cp\u003eHow does it work?  We regularly scrape card and pricing data from\nScryfall (pursuant to their terms of service) and make it available\nin a visual, searchable database.  The \u003ca href=\"#!/docs\"\u003eVault of\nCardboard Query Language\u003c/a\u003e gives you unprecedented power in searching\nthe totality of printed Magic: the Gathering cards.\u003c/p\u003e\n\n\u003cp\u003eRight now, we're in a bit of a closed+open beta, publicly-ish.\nThe collection management aspects of the Vault are still under development,\nand are subject to change, so we have not yet made the user account signup\nprocess open to any or all.  However, you can still search the database\neven without an account!\u003c/p\u003e\n","release":"launch","title":"Welcome to the Vault!"}]}
